In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Iris.csv')
df.columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

## Select all rows and few columns

In [3]:
df1 = df.loc[:,['Id','Species']]
df1.sample()

    Id          Species
92  93  Iris-versicolor

## Select few rows and all columns

In [4]:
df2 = df.loc[10:50,:]
df2.head()

    Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
10  11            5.4           3.7            1.5           0.2  Iris-setosa
11  12            4.8           3.4            1.6           0.2  Iris-setosa
12  13            4.8           3.0            1.4           0.1  Iris-setosa
13  14            4.3           3.0            1.1           0.1  Iris-setosa
14  15            5.8           4.0            1.2           0.2  Iris-setosa

# Now, we can do it with iLoc

In [20]:
df3 = pd.read_csv('owid-energy-data.csv')
df4 = df3.iloc[:,[0,1,3,5,6]]
df4

,country,year,population,biofuel_cons_change_pct,biofuel_cons_change_twh
0,ASEAN (Ember),2000,NaN,NaN,NaN
1,ASEAN (Ember),2001,NaN,NaN,NaN
2,ASEAN (Ember),2002,NaN,NaN,NaN
3,ASEAN (Ember),2003,NaN,NaN,NaN
4,ASEAN (Ember),2004,NaN,NaN,NaN
...,...,...,...,...,...
21807,Zimbabwe,2019,15354606.0,NaN,NaN
21808,Zimbabwe,2020,15669663.0,NaN,NaN
21809,Zimbabwe,2021,15993525.0,NaN,NaN
21810,Zimbabwe,2022,16320539.0,NaN,NaN
21811,Zimbabwe,2023,16665407.0,NaN,NaN

In [24]:
df5 = df4.dropna()
df5.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1488 entries, 250 to 21427
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   country                  1488 non-null   object
 1   year                     1488 non-null   int64
 2   population               1488 non-null   float64
 3   biofuel_cons_change_pct  1488 non-null   float64
 4   biofuel_cons_change_twh  1488 non-null   float64
dtypes: float64(3), int64(1), object(1)
memory usage: 69.8+ KB